#+LINK:bbg file:


| Name | Adress | Role |
|------+--------+------|
|      |        |      |


#+CONSTANTS: skbios=string("1.15.0")



| 1         |      2 | 3         |      4 |      5 | 6      |
|           |        |           |   curr |    new |        |
| Board     | System | CPU       |   BIOS |   BIOS | action |
|-----------+--------+-----------+--------+--------+--------|
| good day5 |        | good day2 | 1.15.0 | 1.15.0 |        |
| good day5 |        | good day2 | 1.13.0 | 1.15.0 | update |
| good day5 |        | good day2 |        | 1.15.0 | update |
| good day5 |        | good day2 |        | 1.15.0 | update |
#+TBLFM: $1=string("good day5");
#+TBLFM: $3=string("good day2"); :: $5=$skbios; :: $6=if("$5" == "$4", string(""), update);
#+TBLFM: @1=string("this @1");

Define constants with #+CONSTANTS:
Defind forumulas with #+TBLFM:
    - Columns referenced by $colnum
    - Rows referenced by @rownum



C-u M-! result of shell
C-c | or  C-u 2 C-c | for 2 SPC to column formation

sort with C-c ^
S-RET copies the value down, incrementing numeric values.

total 1220
       :=@11$2 => 4096
          :=vsum(@2..@7) => 81
|  1 |  Date | Time | User     |    |       | Name                        |          | S+RET | C-c ^ (sort) |     |            |
|----+-------+------+----------+----+-------+-----------------------------+----------+-------+--------------+-----+------------|
|  2 | 12288 |   12 | thinkpad | 11 | 14:30 | teset.org                   | thinkpad |  0.33 |           11 | Mar | drwxr-xr-x |
|  3 |  4096 |   65 | thinkpad |  6 | 10:59 | test.123                    | thinkpad |  0.66 |           10 | Mar | drwxr-xr-x |
|  4 | 27382 |    1 | thinkpad | 11 | 13:55 | test.file                   | thinkpad |  0.99 |            9 | Mar | -rw-r--r-- |
|  5 |    41 |    1 | thinkpad |  8 | 16:21 | 03diary2020.org             | thinkpad |  1.32 |            8 | Mar | lrwxrwxrwx |
|  6 |     9 |    1 | thinkpad |  8 | 16:19 | _1_emacs_index.org          | thinkpad |  1.65 |            7 | Mar | lrwxrwxrwx |
|  7 |    11 |    1 | thinkpad |  1 | 20:38 | emacs_ln_index.org_test.org | thinkpad |  1.98 |            6 | Mar | lrwxrwxrwx |
|  8 |   717 |    1 | thinkpad | 18 | 18:23 | add_hook.org                | thinkpad |  2.31 |            5 | Feb | -rw-r--r-- |
|  9 |   591 |    1 | thinkpad |  2 | 15:49 | add_hook.org~               | thinkpad |  2.64 |            4 | Jan | -rw-r--r-- |
| 10 |   597 |    1 | thinkpad | 11 | 09:58 | agenda_list.org             | thinkpad |  2.97 |            3 | Mar | -rw-r--r-- |
| 11 |  4096 |   81 |          |    |       |                             |          |   3.3 |            2 |     |            |
#+TBLFM: @11$2=@3$2::@11$3=vsum(@2..@7)

::@11$4=@11$2
clock table123
clock   table1
clock table1
|                             |                                                        |                                   | <3> | <7>     |                                                              |
| Name                        |                                                        |                                   |     |         |                                                              |
|-----------------------------+--------------------------------------------------------+-----------------------------------+-----+---------+--------------------------------------------------------------|
| teset.org                   | (mpv + 1) / (a*(teset.org) good day)                   | teset.org hello                   |     |         | (mpv + 1) / (a*(teset.org) string( world))                   |
| test.123                    | (mpv + 1) / (a*(test.123) good day)                    | 6                                 |     | 7로 한글 | (mpv + 1) / (a*(test.123) string( world))                    |
| test.file                   | (mpv + 1) / (a*(test.file) good day)                   | test.file hello                   | 123 | 한글폭  | (mpv + 1) / (a*(test.file) string( world))                   |
| 03diary2020.org             | (mpv + 1) / (a*(03diary2020.org) good day)             | 03diary2020.org hello             |     | 맞아들어감 | (mpv + 1) / (a*(03diary2020.org) string( world))             |
| _1_emacs_index.org          | (mpv + 1) / (a*(_1_emacs_index.org) good day)          | _1_emacs_index.org hello          |     | ㅁㄴㅇㄹ | (mpv + 1) / (a*(_1_emacs_index.org) string( world))          |
| emacs_ln_index.org_test.org | (mpv + 1) / (a*(emacs_ln_index.org_test.org) good day) | emacs_ln_index.org_test.org hello |     | ㅁaaㄴㅇㄹㅁ | (mpv + 1) / (a*(emacs_ln_index.org_test.org) string( world)) |
| add_hook.org                | (mpv + 1) / (a*(add_hook.org) good day)                | add_hook.org hello                |     | asdfasdfa한글입력 | (mpv + 1) / (a*(add_hook.org) string( world))                |
| add_hook.org~               | (mpv + 1) / (a*(add_hook.org~) good day)               | add_hook.org~ hello               |     | asdfasdfasdf | (mpv + 1) / (a*(add_hook.org~) string( world))               |
| agenda_list.org             | (mpv + 1) / (a*(agenda_list.org) good day)             | agenda_list.org hello             |     | ㅁㄴㅇㄹㅁ | (mpv + 1) / (a*(agenda_list.org) string( world))             |
|                             | (mpv + 1) / (a*(0) good day)                           | hello                             |     |         | (mpv + 1) / (a*(0) string( world))                           |
#+TBLFM: $6=(mpv+1)/a/string("$1") string( string(" world"))::@5$4=123
#+TBLFM: $2=(mpv+1)/a/string("$1") string("good day")::$3='(concat $1 " hello")::@4$3=6
[[file:table.org::clock table2]]
file:table.org::clock table1
file:table.org::C-c
C-c C-' EDIT formular 편집의 여러줄로 #TBLFM을 만들어 두고 각 줄로 쉽게 내용을 변경(C-c C-c 수식편집완료)하는 것이 가능할 것이다. C-u C-c C-c(식을 적용)함
- 한줄만 공식으로 적용됨!
(info "(org) Editing and debugging formulas")
(setq org-link-search-must-match-exact-headline nil)
clock table2
| 123 | 123 | 123 | 123 |
|     |     |     |     |
|     |     |     |     |
|     |     |     |     |
|     |     |     |     |
#+TBLFM: 
<< clocktable1 >>
[[clocktable1]]
** 테스트 오그 타임테이블
   :LOGBOOK:
   CLOCK: [2020-03-11 Wed 18:00]--[2020-03-11 Wed 18:08] =>  0:08
   :END:

#+NAME: clock table1
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2020-03-11 Wed 18:06]
| Headline                   | Time   |      |
|----------------------------+--------+------|
| *Total time*               | *0:08* |      |
|----------------------------+--------+------|
| \_  테스트 오그 타임테이블 |        | 0:08 |
#+END:


#+NAME: clock table2


* reference 중요한 자료참조해서 더 연구할 부분추출한 것
** orgcard.pdf에서 취함



#+begin_text org



#+end_text


| <3> |   | <20>         | <10>               |
|-----+---+--------------+--------------------|
|     | 1 | ㅁㄴㅇㄹ   1 | ㄹㅁㄴㅇㄹㄴㅁㅇㄹ |
|     |   |              |                    |
- 일단 확인은 그곳에서.. 보면서 브래인스토밍으로 수집만 해둠.
 #+begin_src emacs-lisp C-cC-vC-d(코드블록분할):Divide&Conquer방식(src_tangle.org)
;;quote구조의 org lang으로 실시함
;;C-cC-vC-d(코드블록창설):전체구조목적
   ;:구조를 전체로 : 복사해서 붙인다. 그것을 코드블록분할로 나눈다.
   ;;C-cC-vC-d(코드블록분할):Divide&Conquer방식
   ;;- 등으로 순서를 배치한다음 2칸정도 띄운 다음 실제로 사용할 것을 나눈다.
     ;(test) ;; 전체과정을 기술함. 코드별이동은 C-c C-v n / p / u로 코드부분만을 골라서 이동함.
;; 편집하기 쉬운 구조임 C-c C-v C-x	org-babel-do-key-sequence-in-edit-buffer 전체블록이 탭으로 이동되는 등 연구필요함
;; 연습을 하기 쉬운 구조임 
;; C-c C-v C-v → (이후)C-x C-q(편집모드로 전환해서 자유롭게 발상을 입력해 본다 C-x 1 전체단일화면) → 복귀시에도 원상복구됨! 
   (message "C-cC-vC-d(코드블록분할):Divide&Conquer방식")
#+end_src

#+RESULTS:
: C-cC-vC-d(코드블록분할):Divide&Conquer방식

#+BEGIN_quote org
;; 후기 감상: 마치 나를 위해 설계된 것처럼 놀라운 기능의 발견에 감탄! C-c C-v h	org-babel-describe-bindings 주로 살펴서 더 정보를 캐낼 것 아니, 블록을 만들어 보면 어떨까
;; 즉 이전의 모든 것이 연결되는 놀라운 경험을 하는 것 같아 놀랍다!
;; 전체무명이 본각이며, 모름은 앎의 이면이라. 내부의 모름이 곧 즉 통이다
#+BEGIN_SRC sh


ㅁㄴㅇㄹ

#+END_SRC

ㅁㄴㅇㄹ

 #+BEGIN_SRC sh
#+END_SRC


#+END_quote


 #+begin_quote org

#+BEGIN_SRC sh


#+END_SRC

- 1
  #+begin_src emacs-lisp :구조를 전체중 일부를 
#+end_src
- 2
  #+begin_src emacs-lisp :구조를 전체중 일부를 
(test) ;
#+end_src
- 3
  #+begin_src emacs-lisp :구조를 전체중 일부를 
        ; 설명을 기록함
#+end_src

#+BEGIN_SRC rust
-- test

// good in the way of thought
#+END_SRC



Tables
Creating a table
just start typing, e.g.
 |Name|Phone|Age RET |- TAB
convert region to table
 C-c |
... separator at least 3 spaces
 C-3 C-c |
Commands available inside tables
The following commands work when the cursor is inside a table.
Outside of tables, the same keys may have other functionality.
Re-aligning and field motion
re-align the table without moving the cursorre-align the table, move to next field
move to previous field
re-align the table, move to next row
move to beginning/end of field
C-c C-c
TAB
S-TAB
RET
M-a/e
Row and column editing
move the current column left
kill the current column
insert new column to left of cursor position
M-LEFT/RIGHT
M-S-LEFT
M-S-RIGHT
move the current row up/down
kill the current row or horizontal line
insert new row above the current row
insert hline below (C-u : above) current rowinsert hline and move to line below it
sort lines in region
M-UP/DOWN
M-S-UP
M-S-DOWN
C-c -
C-c RET
C-c ^
Regions
cut/copy/paste rectangular region
fill paragraph across selected cells
C-c C-x C-w/M-w/C-y
C-c C-q
Miscellaneous
 | <3> |
 <10>
 |
to limit column width to N characters, use
 ...| <N> |...
edit the current field in a separate window
 C-c ‘
make current field fully visible
 C-u TAB
export as tab-separated file
 M-x org-table-export
import tab-separated file
 M-x org-table-import
sum numbers in current column/rectangle
 C-c +
Tables created with the table.el package
insert a new table.el table
recognize existing table.el table
convert table (Org-mode ↔ table.el)
C-cC-cC-c~
C-c
~
Spreadsheet
Formulas typed in field are executed by TAB, RET and C-c C-c.
= introduces a column formula, := a field formula.
Example: Add Col1 and Col2
... with printf format specification
... with constants from constants.el
sum from 2nd to 3rd hline
apply current column formula
|=$1+$2 |
|=$1+$2;%.2f|
|=$1/$c/$cm |
|:=vsum(@II..@III)|
| = |
set and eval column formula
set and eval field formula
re-apply all stored equations to current linere-apply all stored equations to entire table
iterate table to stability
rotate calculation mark through # * ! ˆ $
show line, column, formula reference
toggle grid / debugger
C-c =
C-u C-c =
C-c *
C-u C-c *
C-u C-u C-c *
C-#
C-c ?
C-c }/{



#+end_quote


#+begin_quote org




#+end_quote

   #+begin_src org


#+end_src


